<a href="https://colab.research.google.com/github/Surendra58/AI/blob/master/Lannet_Technologies.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
# Write a python function which take a dataframe as input and deals with the issue of outliers in all the continuous variables.
# Things to consider:
# · It’s up to you on how you want to deal with outliers. You can either remove them or impute them.
# · We consider outliers as incorrect entries and not the one which are natural. For example, in the salary column, if there is a value of $1,000,000 then this value can be due to a natural cause (like it’s a salary for a CEO) or it can be a case of incorrect entry (like someone put an extra zero). So, we are only after incorrect entries.
# · Function should also identify which columns are continuous so that you can perform outlier removal on these columns
# · The code must be very fast so you cannot use multivariate approach which are based on distance calculation between allpoints.

In [1]:
import pandas as pd,numpy as np
from pandas.api.types import is_numeric_dtype
np.random.seed(42)
name=['name'+str(i) for i in range(50)]
address=['address'+str(i) for i in range(50)]
age=np.random.randint(20,100,50)
salary=np.random.randint(50000,1000000,50)
df=pd.DataFrame(data={'age':age,'name':name,'address':address,'salary':salary})
# df
# function for outlier detection and removal
def remove_outlier(df):
    low=.05
    high=.95
    quant_df=df.quantile([low,high])
    for name in list(df.columns):
      if is_numeric_dtype(df[name]):
       df=df[(df[name] > quant_df.loc[low,name]) 
               & (df[name] < quant_df.loc[high,name])]
    return df
remove_outlier(df).head()

   age   name   address  salary
0   71  name0  address0  622843
1   34  name1  address1  306508
2   91  name2  address2  853591
4   40  name4  address4  156530
7   43  name7  address7  510337

In [ ]:
# Write a function in python that inputs a dataframe and identify which columns have date in them. Using these date columns make new columns which are difference between these columns taking 2 at a time. (for instance if there is date1, date2, date3 columns, output should be like date1-date2, date2-date3, date1-date3). For this problem only, print out data in the colab.
# Thing to consider
# · Date column might have some invalid entries in them
# · Date can be of different format throughout the column
# · Code should be efficient and fast
# · Code should be well commented and easy to interpret
# · Use google Colab
# · Code should be robust enough to run on any dataset
# · Make a dummy dataset by yourself.

In [2]:
import pandas as pd
df=pd.DataFrame({'NAME':['A','B','C','D','E'],
   'Date1':['2020-04-04',
           '2020-03-04',
           '2020-08-04',
           '2020-06-04',
           '2020-05-03'],
    'Sex':['M','F','M','F','M'],
    'Date2':['2019-05-04',
           '2019-04-04',
           '2019-04-04',
           '2019-02-04',
           '2019-07-03'],
   'Date3':['2018-02-04',
           '2018-02-04',
           '2018-02-04',
           '2018-02-04',
           '2018-02-03']})
#df
mask=df.astype(str).apply(lambda x : x.str.match(r'(\d{2,4}-\d{2}-\d{2,4})+').all())
df1=df.loc[:,mask]=df.loc[:,mask].apply(pd.to_datetime)
df1

       Date1      Date2      Date3
0 2020-04-04 2019-05-04 2018-02-04
1 2020-03-04 2019-04-04 2018-02-04
2 2020-08-04 2019-04-04 2018-02-04
3 2020-06-04 2019-02-04 2018-02-04
4 2020-05-03 2019-07-03 2018-02-03

In [4]:
# Difference of Date1 and Date2
Datediff1=df1['Date1'].subtract(df1['Date2']).dt.days
print("\nDifference of Date1 and Date2 are in Days:\n",Datediff1)

Difference of Date1 and Date2 are in Days:
 0    336
1    335
2    488
3    486
4    305
dtype: int64

In [5]:
# Difference of Date2 and Date3
Datediff2=df1['Date2'].subtract(df1['Date3']).dt.days
print("\nDifference of Date2 and Date3 are in Days:\n",Datediff2)

Difference of Date2 and Date3 are in Days:
 0    454
1    424
2    424
3    365
4    515
dtype: int64

In [6]:
# Difference of Date1 and Date3
Datediff3=df1['Date1'].subtract(df1['Date3']).dt.days
print("\nDifference of Date1 and Date3 are in Days:\n",Datediff3)

Difference of Date1 and Date3 are in Days:
 0    790
1    759
2    912
3    851
4    820
dtype: int64